{
	"id": "basics",
	"name": "<b>Базовые концепты</b>",
	"overview": "В этой секции разъясняются концепты, необходимыя для понимания языка <b>C++.</b>",

	"data_types": 
	{
		"name": "Типы данных",
		"page_1": 
		[
			"Каждая переменная имеет определенный тип. И этот тип определяет, какие значения может иметь переменная, какие операции с ней можно выполнять и сколько байтов в памяти она будет занимать. Следующие основные типы данных определены в <b>C++</b>:",
			"<b>bool:</b> логический тип. Может принимать одно из двух значений - _ True_ и _False_. Размер занимаемой памяти для этого типа точно не определен.",
			"<b>char:</b> представляет собой один символ ASCII. Он занимает в памяти 1 байт (8 бит). Может хранить любое значение от «-128» до «127» или от «0» до «255».",
			"<b>signed char:</b> представляет один символ. Он занимает в памяти 1 байт (8 бит). Может хранить любое значение от «-128» до «127».",
			"<b>unsigned char:</b> представляет один символ. Он занимает в памяти 1 байт (8 бит). Может хранить любое значение от «0» до «255».",
			"<b>wchar_t:</b> представляет собой широкий персонаж. В Windows он занимает в памяти 2 байта (16 бит), в Linux - 4 байта (32 бита). Может хранить любое значение от 0 до 65 535 (для 2 байтов) или от 0 до 4 294 967 295 (для 4 байтов).",
			"<b>char16_t:</b> представляет один символ Юникода. Он занимает в памяти 2 байта (16 бит). Может хранить любое значение от «0» до «65535»."

		],
		"page_2":
		[
			"<b>char32_t:</b> представляет один символ Юникода. Он занимает 4 байта (32 бита) в памяти. Может хранить любое значение от 0 до 4 294 967 295.",
			"<b>short:</b> представляет собой целое число в диапазоне от –32768 до 32767. Занимает 2 байта (16 бит) в памяти.",
			"<b>unsigned short:</b> представляет собой целое число в диапазоне от 0 до 65 535. Занимает 2 байта (16 бит) в памяти.",
			"<b>int:</b> представляет собой целое число. В зависимости от архитектуры процессора он может занимать 2 байта (16 бит) или 4 байта (32 бита). Диапазон предельных значений, соответственно, также может варьируются от -32768 до 32767 (для 2 байтов) или от -2 147 483 648 до 2 147 483 647 (для 4 байтов). Но в любом случае размер должен быть больше или равен размеру короткого типа и меньше или равен размер длинного типа. Этот тип является синонимом <b> signed int </b> и <b> signed </b>.",
			"<b>unsigned int:</b> представляет собой положительное целое число. Оно может занимать 2 байта (16 бит) или 4 байта (32 бита) в зависимости от архитектуры процессора, и поэтому диапазон предельных значений может варьируются: от 0 до 65535 (для 2 байтов) или от 0 до 4 294 967 295 (для 4 байтов). В качестве синонима этого типа может использоваться <b> беззнаковый </b>.",
			"<b>long:</b> представляет целое число от -2 147 483 648 до 2 147 483 647. Он занимает 4 байта (32 бита) памяти. Этот тип также имеет синонимы для <b> long int </b>, <b> подписанное длинное целое </b> и <b> длинное подписанное </b>.".
			
		],
		"page_3":
		[
			"<b>unsigned long:</b> представляет собой целое число от 0 до 4 294 967 295. Занимает 4 байта (32 бита) памяти. Это синоним <b> unsigned long int </b>.",
			"<b>long long:</b> представляет собой целое число в диапазоне от -9 223 372 036 854 775 808 до +9 223 372 036 854 775 807. Обычно занимает 8 байтов (64 бита) памяти. Синонимы: < b> long long int </b>, <b> signed long long int </b> и <b> signed long long </b>. ",
			"<b>unsigned long long:</b> представляет собой целое число от 0 до 18 446 744 073 709 551 615. Обычно занимает 8 байтов (64 бита) памяти. Это синоним <b> unsigned long long int </b>.",
			"<b>float:</b> представляет собой вещественное число с плавающей запятой в диапазоне от +/- 3,4E-38 до 3,4E + 38. Занимает 4 байта (32 бита) в памяти.",
			"<b>double:</b> представляет действительное число с плавающей запятой двойной точности в диапазоне от +/- 1,7E-308 до 1,7E + 308. Оно занимает 8 байтов (64 бита) в памяти.",
			"<b>long double:</b> представляет действительное число с плавающей запятой двойной точности размером не менее 8 байтов (64 бита). Диапазон допустимых значений может отличаться в зависимости от размера занимаемой памяти.",
			"<b>void:</b> тип без значения.",
			"Таким образом, все типы данных, кроме void, можно разделить на три группы: символьные (char, wchar_t, char16_t, char32_t), целые (short, int, long, long long) и типы чисел с плавающей запятой (float, double, long double )."
		]
	},
	"variables": 
	{
		"name": "Переменные",
		"page_1":
		[
			"The types char, wchar_t, char16_t and char32_t are used to represent characters in the application. Lets define some variables: \n 1. <code>char c = d;</code> \n 2. <code>wchar_t d = c;</code> \n"
		]
	},
	"arithmetical_operations": 
	{
		"name": "Арифметические операции"
	},
	"static_typization": 
	{
		"name": "Статическая типизация"
	},
	"constants": 
	{
		"name": "Константы"
	},
	"console_io": 
	{
		"name": "Ввод/вывод в консоли"
	},
	"namespaces": 
	{
		"name": "Пространства имён"
	},
	"bit_operations": 
	{
		"name": "Побитовые операции"
	},
	"logical_operations": 
	{
		"name": "Логические операции"
	},
	"conditional_constructions": 
	{
		"name": "Условные конструкции"
	},
	"loops": 
	{
		"name": "Циклы"
	},
	"links": 
	{
		"name": "Ссылки"
	},
	"arrays": 
	{
		"name": "Массивы"
	},
	"strings": 
	{
		"name": "Строки"
	}
}
