{
	"id": "containers",
	"name": "<b>Последовательные контейнеры</b>",
	"overview": "В этом разделе объясняются концепции, которые имеют решающее значение для понимания <b>последовательных контейнеров</b>.",

	"types": {
		"name": "Типы",
		"page_1": [
			"Для управления наборами объектов в стандартной библиотеке C++ определены контейнеры. Контейнер представляет коллекцию объектов определенного типа. Последовательный же контейнер (sequential container) позволяет котроллировать порядок, в котором элементы располагаются в коллекции, и управлять доступом к этим элементам. \nТипы последовательных контейнеров:",
			"<b>vector</b>: массив переменного размера. \nПоддерживает произвольный доступ к любому элементу в контейнере. \nОбеспечивает добавление и удаление элементов из любого места контейнера. \n<b>deque</b>: двусторонняя очередь. \nПоддерживает произвольный доступ к любому элементу в контейнере. \nОбеспечивает удаление и добавление элементов в начале и в конце контейнера.",
			"<b>list</b>: двухсвязный список. \nПоддерживает только последовательный двухнаправленный доступ к элементам. \nОбеспечивает удаление и добавление элементов в начале и в конце контейнера. \n<b>forward_list</b>: односвязный список. \nПоддерживает только однонаправленный последовательный доступ к элементам. \nОбеспечивает удаление и добавление элементов в начале и в конце контейнера.",
			"<b>array</b>: массив фиксированного размера. \nПоддерживает произвольный доступ к любому элементу в контейнере. \nДобавлять или удалять элементы из контейнера нельзя. \n<b>string</b>: представляет контейнер, аналогичный вектору, который состоит из символов, то есть строку",
			"Таким образом, стандартная библиотека C++ по умолчанию содержит ряд контейнеров, которые представляют определенные структуры данных. Все они имеют как некоторые общие, так и специфические возможности. За исключением класса array все они поддерживают добавление и удаление элементов. Основное различие между ними состоит в том, как они обеспечивают добавление и удаление элементов, а также доступ к элементам в контейнере. И в зависимости от ситуации и потребностей можно использовать тот или иной тип контейнеров.",
			"Для использования определенного контейнера в программу необходимо добавить соответствующий заголовочный файл, который, как правило, называется по имени класса контейнера. \nКроме того, при определении переменной контейнера необходимо установить ограничение на тип элементов, которые будет содержать контейнер. Тип элементов передается в угловых скобках. Например, определение переменной класса vector, которая хранит числовые данные типа int:",
			"<code>std::vector<int> v1;</code> \nПри компиляции программы, которая использует контейнеры, с помощью компилятора g++ может потребоваться указать флаг <b>-static</b>: \n<b>g++ hello.cpp -o hello -static</b>"
		]
	}
}
